{"extracted_information": "Die Eventbrite REST API ermöglicht die Kommunikation zwischen Eventbrite und Anwendungen/Websites mittels HTTP-Anfragen. Anfragen und Antworten sind im JSON-Format (UTF-8 kodiert, URL-kodierte Werte), mit einer GET-Alternative für Anfragen. Alle URLs verwenden die Basis-URL https://www.eventbriteapi.com/v3. API-Anfragen sind authentifiziert; weitere Details sind in der Dokumentation zur Authentifizierung zu finden. Die Dokumentation definiert zahlreiche API-Konzepte und Fachbegriffe.", "specifications": {"api_type": "REST API", "communication_protocol": "HTTP", "data_format": "JSON", "encoding": "UTF-8", "value_encoding": "URL-encoded", "http_methods_supported": ["GET", "POST", "DELETE"]}, "pricing": {}, "features": [{"term": "Absorbed Fees", "description": "Eventbrite-Transaktionsgebühren, die im angezeigten Ticketpreis enthalten sind; Kreditkartenbearbeitungsgebühren und Steuern sind nicht vom Basisticketpreis getrennt."}, {"term": "Attendee", "description": "Einzelperson mit einem Ticket für und der Absicht, an einem Event teilzunehmen."}, {"term": "Attendee Team", "description": "Eine Gruppierung von Event-Teilnehmern, z.B. ein Baseballteam in einem Baseballturnier."}, {"term": "Bookmark", "description": "Ein Besucher der Eventbrite-Website hat das Event als Lesezeichen gespeichert."}, {"term": "Capacity", "description": "Maximale Anzahl der Tickets, die für ein Event verkauft werden können."}, {"term": "Category", "description": "Die Event-Klasse, z.B. Musik."}, {"term": "Endpoint", "description": "Eine URL, die Teil der Eventbrite-API ist; jede Ressource wird an einem API-Endpunkt exponiert. Diese Endpunkte werden verwendet, um Eventbrite durch Akzeptanz von Webanfragen in andere Anwendungen zu integrieren."}, {"term": "Expansion", "description": "Um die Anzahl der API-Aufrufe und die Größe der Antworten zu begrenzen, sind Antworten normalerweise kurz und zeigen nur eine Basisdarstellung (Untermenge) der Ressource. Zusätzliche erweiterte Informationen zu bestimmten Elementen können jedoch durch die Verwendung einer Expansion erhalten werden."}, {"term": "Format", "description": "Art des Events, z.B. Konferenz, Seminar, Konzert."}, {"term": "HTTP Verbs (Methods)", "description": "Die Eventbrite-API verwendet die folgenden HTTP-Verben (Methoden), die für jede Aktion geeignet sind.", "details": [{"verb": "GET", "description": "Ressource abrufen", "example_action": "Alle Events nach Veranstaltungsort auflisten"}, {"verb": "POST", "description": "Ressource erstellen oder aktualisieren", "example_action": "Event erstellen oder ein Event aktualisieren"}, {"verb": "DELETE", "description": "Ressource löschen", "example_action": "Event löschen"}]}, {"term": "Object", "description": "Ein Objekt in der Eventbrite-API, das ein Geschäfts-Substantiv darstellt, wie Event oder Attendee. Auch als Ressource bezeichnet."}, {"term": "Order Owner", "description": "Einzelperson, die ein Event-Ticket kauft. Nicht unbedingt ein Attendee, da der Order Owner möglicherweise Tickets für jemand anderen kauft."}, {"term": "Organization", "description": "Ein Objekt, das eine Geschäftsstruktur (wie eine Marketingabteilung) darstellt, in der Events erstellt und verwaltet werden. Organisationen gehören einem Benutzer und können mehrere Mitglieder haben."}, {"term": "Organizer", "description": "Objekt, das die öffentlich auftretende Einheit darstellt, die das Event organisiert. Organizer hat kein Eventbrite-Konto und besitzt keine Events."}, {"term": "Pagination", "description": "Prozess der Aufteilung von Ergebnissen in überschaubare Abschnitte. Alle API-Endpunkte, die Ergebnisse zurückgeben, sind paginiert. Diese Ergebnisse werden in einer definierten Reihenfolge in Gruppen von 50 aufgelistet, wobei die erste Seite angezeigt wird. Um zusätzliche Ergebnisseiten anzuzeigen, muss die gewünschte Seite in der Anfrage angegeben werden."}, {"term": "REST", "description": "Ein Software-Architekturstil. REST definiert eine Reihe von Einschränkungen, die zum Erstellen von Webdiensten und zum Bearbeiten von Ressourcen verwendet werden. Die Eventbrite-API verwendet REST."}, {"term": "Subcategory", "description": "Die Event-Unterklasse, z.B. Klassik."}, {"term": "Ticket Class", "description": "Eine Ticketart. Typischerweise sind mehrere verschiedene Ticketarten für ein Event verfügbar. Es gibt drei Eventbrite Ticket-Klassen: Kostenlos, Bezahlt und Spende."}, {"term": "Ticket Price", "description": "Der Gesamt-Ticketpreis setzt sich zusammen aus dem Ticket-Basispreis + Eventbrite-Gebühr + Kreditkarten-Gebühr + Steuer."}, {"term": "User", "description": "Hat ein Eventbrite-Konto, ist Mitglied einer oder mehrerer Organisationen und kann die erforderlichen Berechtigungen zum Erstellen und Verwalten von Events haben."}, {"term": "Viewport", "description": "Ein rechteckiger Abschnitt einer Karte, der aktuell gerendert wird und den Event-Standort anzeigt."}, {"term": "Visitor", "description": "Eine Person, die ein Event auf der Eventbrite-Website ansieht, aber noch kein Order Owner geworden ist, indem sie Tickets gekauft hat."}], "statistics": {}, "temporal_info": {}, "geographical_data": {}, "references": [{"type": "authentication_documentation", "url": "/platform/docs/authentication", "description": "Detaillierte Informationen zur Authentifizierung des Zugriffs auf die Eventbrite-API."}]}