{"extracted_information": "Dieses Dokument beschreibt Berechtigungen als granulare, vom App-Nutzer erteilte Graph API-Autorisierungen. Es betont die Notwendigkeit, nur die für die App-Funktion erforderlichen Berechtigungen auszuwählen, da unnötige Berechtigungen ein häufiger Grund für die Ablehnung während der App-Überprüfung sind. Erteilte Berechtigungen dürfen auch für Analysen und Marketingzwecke mit aggregierten und anonymisierten Daten verwendet werden.", "specifications": {"app_review_anforderungen": [{"name": "Meta App Review", "description": "Erforderlich für Apps, die Zugriff auf Daten benötigen, die nicht im Besitz oder unter der Verwaltung des Nutzers sind."}, {"name": "Business Verifizierung", "description": "Erforderlich für alle Apps, die Anfragen für 'Advanced Access' stellen."}, {"name": "Fragen zur Datenverarbeitung", "description": "Möglicherweise erforderlich, wenn Ihre App die Berechtigung anfordert, einen API-Endpunkt zu verwenden, um auf Benutzerdaten zuzugreifen."}, {"name": "Jährlicher Datenverwendungs-Checkup", "description": "Kann jährlich erforderlich sein."}], "berechtigungsmanagement": {"anforderung_von_berechtigungen": "Wenn App-Nutzer sich bei Ihrer App anmelden, erhalten sie eine Anfrage zur Erteilung der von Ihrer App angeforderten Berechtigungen. Die Nutzer können die angeforderten Berechtigungen oder eine Untermenge davon erteilen oder verweigern. Methoden zum Anfordern von Berechtigungen umfassen Facebook Login, Facebook Login for Business, Instagram API mit Facebook Login for Business, Instagram API mit Business Login for Instagram und Meta Business Manager.", "wiedererteilung_von_berechtigungen": "Wird eine Berechtigung 90 Tage lang nicht genutzt (normalerweise aufgrund von Benutzerinaktivität), muss der App-Nutzer sie der App erneut erteilen.", "entfernung_von_berechtigungen": "Berechtigungen können über das Meta App Dashboard entfernt werden, wenn sie nicht mehr verwendet werden oder veraltet sind."}}, "features": [{"permission_name": "instagram_manage_events", "description": "Die `instagram_manage_events`-Berechtigung erlaubt einer App, Ereignisse (z.B. Käufe, In-den-Warenkorb, Leads) im Namen von Instagram-Konten zu protokollieren, die von den Nutzern der App verwaltet werden. Die erlaubte Nutzung dieser Berechtigung ist das Protokollieren von Ereignissen auf Instagram-Konten und das Senden dieser Aktivitätsdaten an Meta für Anzeigen-Targeting, Optimierung und Berichterstattung; sowie die Bereitstellung von Marketing- und Werbeanalysen.", "allowed_usage": ["Ereignisse auf Instagram-Konten protokollieren und diese Aktivitätsdaten an Meta für Anzeigen-Targeting, Optimierung und Berichterstattung senden.", "Marketing- und Werbeanalysen bereitstellen."], "dependencies": ["instagram_basic", "pages_read_engagement", "pages_show_list"], "app_review_submission": {"use_case_description": "Geben Sie konkrete Beispiele an, warum Ihre App die `instagram_manage_upcoming_events`-Berechtigung benötigt, um bevorstehende Ereignisse auf Instagram im Namen anderer Unternehmen zu verwalten.", "screencast_requirements": ["Demonstrieren Sie den vollständigen Facebook-Anmeldeprozess auf Ihrer App-Plattform, der zeigt, wie Ihr App-Nutzer Ihrer App diese Berechtigung erteilt.", "Demonstrieren Sie das Abrufen einer Liste bevorstehender Ereignisse und zeigen Sie, wie Ereignisdetails angezeigt werden.", "Erstellen Sie ein neues Ereignis und demonstrieren Sie, wie Ereignisdetails wie Titel, Datum, Uhrzeit und Ort hinzugefügt werden."]}}, {"permission_name": "instagram_manage_upcoming_events", "description": "Die `instagram_manage_upcoming_events`-Berechtigung erlaubt einer App, bevorstehende Ereignisse im Namen von Instagram-Konten zu lesen, zu erstellen und zu aktualisieren, die von Personen verwaltet werden, die die App nutzen.", "allowed_usage": ["Verwaltung bevorstehender Ereignisse auf Instagram-Konten, die von den Personen verwaltet werden, die die App nutzen."], "dependencies": ["instagram_basic", "pages_read_engagement", "pages_show_list"], "app_review_submission": {"use_case_description": "Geben Sie konkrete Beispiele an, warum Ihre App die `instagram_manage_upcoming_events`-Berechtigung benötigt, um bevorstehende Ereignisse auf Instagram im Namen anderer Unternehmen zu verwalten.", "screencast_requirements": ["Demonstrieren Sie den vollständigen Facebook-Anmeldeprozess auf Ihrer App-Plattform, der zeigt, wie Ihr App-Nutzer Ihrer App diese Berechtigung erteilt.", "Demonstrieren Sie das Abrufen einer Liste bevorstehender Ereignisse und zeigen Sie, wie Ereignisdetails angezeigt werden.", "Erstellen Sie ein neues Ereignis und demonstrieren Sie, wie Ereignisdetails wie Titel, Datum, Uhrzeit und Ort hinzugefügt werden."]}}, {"permission_name": "pages_events", "description": "Die `pages_events`-Berechtigung erlaubt Ihrer App, Ereignisse im Namen von Facebook-Seiten zu protokollieren, die von Personen verwaltet werden, die Ihre App nutzen, und diese Ereignisse an Facebook für Anzeigen-Targeting, Optimierung und Berichterstattung zu senden.", "allowed_usage": ["Geschäftsbezogene Aktivitäten (z.B. Kauf, In-den-Warenkorb, Lead) im Namen von Seiten senden, die den Personen gehören, die Ihre App nutzen."], "dependencies": ["pages_show_list"], "app_review_submission": {"use_case_description": "Besuchen Sie die App Review-Dokumentation für Anleitungen.", "screencast_requirements": "Besuchen Sie die App Review-Dokumentation für Anleitungen."}}, {"permission_name": "whatsapp_business_manage_events", "description": "Die `whatsapp_business_manage_events`-Berechtigung erlaubt einer App, Ereignisse wie Käufe, In-den-Warenkorb, Leads und mehr im Namen eines WhatsApp Business Accounts zu protokollieren, der von einem App-Nutzer verwaltet wird. Die erlaubte Nutzung dieser Berechtigung ist das Protokollieren von Ereignissen auf WhatsApp Business Accounts und das Senden dieser Aktivitätsdaten an Meta für Anzeigen-Targeting, Optimierung und Berichterstattung.", "allowed_usage": ["Ereignisse auf WhatsApp Business Accounts protokollieren.", "Ereignisaktivitätsdaten an Meta für Anzeigen-Targeting, Optimierung und Berichterstattung senden."], "dependencies": ["whatsapp_business_management"], "app_review_submission": {"use_case_description": "Besuchen Sie die App Review-Dokumentation für Anleitungen.", "screencast_requirements": "Besuchen Sie die App Review-Dokumentation für Anleitungen."}}], "statistics": {}, "temporal_info": {"permission_inactivity_period": "90 Tage"}, "geographical_data": {}, "references": [{"name": "Access Tokens", "url": "https://developers.facebook.com/docs/facebook-login/guides/access-tokens"}, {"name": "Maintaining Data Access", "url": "https://developers.facebook.com/docs/development/maintaining-data-access"}, {"name": "Secure Requests", "url": "https://developers.facebook.com/docs/graph-api/guides/secure-requests"}, {"name": "Terms and Policies", "url": "https://developers.facebook.com/docs/development/terms-and-policies"}]}