{"extracted_information": "Die bereitgestellte Dokumentation beschreibt den OAuth-Flow für die Integration von Anwendungen mit der Eventbrite API. Sie behandelt die Authentifizierung des persönlichen Zugangs des Entwicklers sowie die Authentifizierung des Zugangs für die Benutzer der App, wobei zwischen client-seitigen und server-seitigen Anwendungen unterschieden wird.", "specifications": {"oauth_authorize_url": "https://www.eventbrite.com/oauth/authorize", "oauth_access_token_url": "https://www.eventbrite.com/oauth/token"}, "pricing": {}, "features": [{"name": "Authentifizierung des persönlichen Zugangs", "description": "Erforderlich, um die eigene App in die Eventbrite API zu integrieren. Verweist auf separate Dokumentation für Details."}, {"name": "Authentifizierung des Benutzerzugangs (OAuth Token Flow)", "description": "Zum Zugriff auf die API im Namen der Benutzer Ihrer App. Der Flow unterscheidet sich je nach Anwendungsart (client-seitig oder server-seitig).", "required_information": [{"name": "App Key", "description": "Identifiziert Ihre App während des OAuth-Handshakes. Nicht geheim."}, {"name": "Client Secret", "description": "Identifiziert Ihre App während eines server-seitigen Handshakes. Geheim."}, {"name": "Redirect URI", "description": "URI, zu der Benutzer umgeleitet werden, sobald sie den Zugriff auf Ihre App bestätigen. Muss in den Eventbrite App-Einstellungen festgelegt werden."}], "notes": ["Wenn das OAuth Token eines Benutzers abläuft (z.B. bei Passwortänderung), wird ein Fehler empfangen und der Benutzer muss den OAuth Token Flow erneut durchlaufen.", "Wenn der Benutzer weiterhin bestätigten Zugriff auf die Anwendung hat, ist dieser Schritt nicht erneut erforderlich."]}, {"name": "Authentifizierung von Benutzern einer client-seitigen Anwendung", "description": "Flow für client-seitige (JavaScript) Anwendungen.", "redirect_uri_example": "https://www.eventbrite.com/oauth/authorize?response_type=token&client_id=YOUR_APP_KEY&redirect_uri=YOUR_URL", "flow_steps": ["Ihre Benutzer werden von Ihrer Website oder Anwendung zur Eventbrite-Website geleitet.", "Auf der Eventbrite-Website zeigen die Benutzer ihren Wunsch zur Nutzung Ihrer Anwendung durch die Genehmigen/Ablehnen-Seite an.", "Der Benutzer wird zurück zu Ihrer Anwendung oder Website umgeleitet, wie durch die Redirect URI angegeben.", "Wenn der Benutzer den Zugriff auf Ihre Anwendung genehmigt hat, ist ein OAuth-Token im Hash-Fragment der URL enthalten.", "Sie speichern das Benutzer-Token und verwenden es dann, um im Namen des Benutzers auf die API zuzugreifen."]}, {"name": "Authentifizierung von Benutzern einer server-seitigen Anwendung", "description": "Flow für server-seitige Anwendungen.", "redirect_uri_example": "https://www.eventbrite.com/oauth/authorize?response_type=code&client_id=YOUR_APP_KEY", "flow_steps": ["Ihre Benutzer werden von Ihrer Website oder Anwendung zur Eventbrite-Website geleitet.", "Auf der Eventbrite-Website zeigen die Benutzer ihren Wunsch zur Nutzung Ihrer Anwendung durch die Genehmigen/Ablehnen-Seite an.", "Der Benutzer wird zurück zu Ihrer Anwendung oder Website umgeleitet, wie durch die Redirect URI angegeben.", "Wenn der Benutzer den Zugriff auf Ihre Anwendung genehmigt hat, wird ein 'code'-Abfrageparameter am Ende der URL angehängt, der den Zugriffscode darstellt.", "Tauschen Sie den Zugriffscode gegen ein OAuth-Token aus, indem Sie eine POST-Anfrage an 'https://www.eventbrite.com/oauth/token' senden. Die Anfrage gibt das Benutzer-Token zurück.", "Sie speichern das Benutzer-Token und verwenden es dann, um im Namen des Benutzers auf die API zuzugreifen."], "post_request_details": "Die POST-Anfrage in Schritt 5 muss die URL-kodierten Daten zusammen mit dem Content-Type-Header 'application/x-www-form-urlencoded' enthalten."}], "statistics": {}, "temporal_info": {}, "geographical_data": {}, "references": []}